template/fundtrans.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mob="http://mobileServices.web.app.sampath.org">
   <soapenv:Header/>
   <soapenv:Body>
      <mob:initiateTransfer>
         <mob:userId>{{.UserId}}</mob:userId>
         <mob:tfrData>
            <mob:fromAccount>{{.FromAcc}}</mob:fromAccount>
            <mob:onlineFlg>Y</mob:onlineFlg>
            <mob:tpAccount>{{.ToAcc}}</mob:tpAccount>
            <mob:tpAccountRe>{{.ToAcc}}</mob:tpAccountRe>
            <mob:transferAmount>{{.Amount}}</mob:transferAmount>
            <mob:transferMode>TT</mob:transferMode>
         </mob:tfrData>
      </mob:initiateTransfer>
   </soapenv:Body>
</soapenv:Envelope>
